import { TASK } from "../world/constants"
import { BG_GRADIENT_NAME } from "./constants"

/*
    <A-[]> - 'Arctic', empty
    <F-XX> - 'Farm', lock
    <J-01> - 'Jungle', pet level 1
    <O-24> - 'Ocean', pet level 24
    <S-SS> - 'Savannah', clouds
*/

export const LEVELS_FREE_LIST = [
    // FREE 1
    {
        map: [
            '.........<A-01><A-01><A-01>.........',
            '......<A-01><A-01><A-01><A-01>......',
            '...<A-01><A-01><A-01><A-01><A-01>...',
            '<A-01><F-01><S-01><A-01><A-01><J-01>',
            '...<A-01><A-01><A-01><A-01><J-01>...',
            '<A-01><S-01><S-01><A-01><A-01><J-01>',
            '...<O-01><A-01><A-01><A-01><A-01>...',
            '<O-01><O-01><S-01><A-01><A-01><A-01>',
            '...<O-01><A-01><A-01><A-01><A-01>...',
            '......<F-01><A-01><A-01><A-01>......',
            '.........<A-01><A-01><A-01>.........',
        ],
        task: {type: TASK.FREE, value: 0, turns: 0},
        bg: BG_GRADIENT_NAME.Snow
    },

    // FREE 2
    {
        map: [
            '............<A-01>............',
            '.........<A-01><A-01>.........',
            '......<A-01><F-01><S-01>......',
            '...<O-01><A-01><A-01><A-01>...',
            '<S-01><S-01><A-01><A-01><J-01>',
            '...<O-01><A-01><A-01><A-01>...',
            '<S-01><S-01><A-01><A-01><J-01>',
            '...<O-01><A-01><A-01><A-01>...',
            '......<O-01><S-01><A-01>......',
            '.........<O-01><A-01>.........',
        ],
        task: {type: TASK.FREE, value: 0, turns: 0},
        bg: BG_GRADIENT_NAME.Indigo
    },

    // FREE 3
    {
        map: [
            '......<A-01><A-01>......',
            '...<A-01><A-[]><A-01>...',
            '<F-01>..................',
            '...<S-01><S-[]><F-01>...',
            '..................<J-01>',
            '...<J-01><J-[]><J-01>...',
            '......<J-01><J-01>......',
        ],
        task: {type: TASK.FREE, value: 0, turns: 0},
        bg: BG_GRADIENT_NAME.Glam
    },
]

export const LEVELS_LIST = [
    // POINT 1
    // MAP 1-1
    {
        map: [
            '........................',
            '.........<A-01>.........',
            '......<A-01><A-01>......',
            '...<S-01><S-[]><A-01>...',
            '......<S-01><J-01>......',
            '.........<S-01>.........',
            '........................',
        ],
        // if type = NEW -> value = максимально возможный итоговый PET LEVEL
        // value - какой PET LEVEL можно получить из карты максимум
        task: {type: TASK.NEW, value: 4, turns: 0},
        bg: BG_GRADIENT_NAME.Blue
    },

    // MAP 1-2
    {
        map: [
            '........................',
            '...<A-[]>......<A-[]>...',
            '<A-01><A-01><A-01><A-01>',
            '...<A-01><A-[]><A-01>...',
            '......<S-01><S-01>......',
            '.........<S-[]>.........',
            '........................',
        ],
        // if type = NEW -> value = максимально возможный итоговый PET LEVEL
        // value - какой PET LEVEL можно получить из карты максимум
        task: {type: TASK.NEW, value: 4, turns: 0},
        bg: BG_GRADIENT_NAME.Glam
    },

    // MAP 1-3
    {
        map: [
            '......<A-01><A-01>......',
            '...<A-01><A-[]><A-01>...',
            '<F-01>..................',
            '...<S-01><S-[]><F-01>...',
            '..................<J-01>',
            '...<J-01><J-[]><J-01>...',
            '......<J-01><J-01>......',
        ],
        // if type = NEW -> value = максимально возможный итоговый PET LEVEL
        // value - какой PET LEVEL можно получить из карты максимум
        task: {type: TASK.NEW, value: 5, turns: 0},
        bg: BG_GRADIENT_NAME.Gold
    },

    // POINT 2
    // MAP 2-1
    {
        map: [
            '......<A-01>............',
            '...<A-01><A-[]>.........',
            '<F-02><A-01><A-01>......',
            '...<S-01><S-XX><J-01>...',
            '......<J-01><J-01><F-02>',
            '.........<J-[]><J-01>...',
            '............<J-01>......',
        ],
        task: {type: TASK.LOCK, value: 1, turns: 0},
        bg: BG_GRADIENT_NAME.Green
    },

    // MAP 2-2
    {
        map: [
            '.........<J-01>.........',
            '......<J-02><J-02>......',
            '...<S-[]><S-[]><S-[]>...',
            '<S-01><S-01><S-01><S-01>',
            '...<S-[]><S-51><S-[]>...',
            '......<J-02><J-02>......',
            '.........<J-01>.........',
        ],
        // if type = NEW -> value = максимально возможный итоговый PET LEVEL
        // value - какой PET LEVEL можно получить из карты максимум
        task: {type: TASK.NEW, value: 6, turns: 0},
        bg: BG_GRADIENT_NAME.Indigo
    },

    // MAP 2-3
    {
        map: [
            '......<A-02><A-51>......',
            '...<A-01><A-XX><A-02>...',
            '<F-01><S-01><S-01><F-02>',
            '...<S-02><O-[]><F-51>...',
            '<S-01><S-01><F-01><J-01>',
            '...<J-01><J-XX><J-01>...',
            '......<J-01><J-01>......',
        ],
        task: {type: TASK.LOCK, value: 2, turns: 0},
        bg: BG_GRADIENT_NAME.Pink
    },

    // POINT 3
    // MAP 3-1
    {
        map: [
            '.........<A-01>.........',
            '......<A-01><A-01>......',
            '...<A-01><A-01><A-01>...',
            '<A-01><A-01><A-01><A-01>',
            '...<A-01><A-01><A-01>...',
            '......<A-01><A-01>......',
            '.........<A-01>.........',
        ],
        // if type = NEW -> value = максимально возможный итоговый PET LEVEL
        // value - какой PET LEVEL можно получить из карты максимум
        task: {type: TASK.NEW, value: 5, turns: 0},
        bg: BG_GRADIENT_NAME.Sky
    },

    // MAP 3-2
    {
        map: [
            '.........<J-01>.........',
            '......<J-51><J-02>......',
            '...<J-[]>......<J-[]>...',
            '<J-01>...<O-XX>...<J-01>',
            '...<J-[]>......<S-[]>...',
            '......<S-01><S-01>......',
            '.........<S-01>.........',
        ],
        task: {type: TASK.LOCK, value: 1, turns: 0},
        bg: BG_GRADIENT_NAME.Snow
    },

    // MAP 3-3
    {
        map: [
            '.........<S-01>.........',
            '......<S-02><S-02>......',
            '...<S-[]><S-01><S-01>...',
            '<S-01><F-01><O-01><S-01>',
            '...<S-01><S-01><S-[]>...',
            '......<S-02><S-02>......',
            '.........<S-01>.........',
        ],
        // if type = NEW -> value = максимально возможный итоговый PET LEVEL
        // value - какой PET LEVEL можно получить из карты максимум
        task: {type: TASK.NEW, value: 5, turns: 12},
        bg: BG_GRADIENT_NAME.lilac
    },

    // POINT 4
    // MAP 4-1
    {
        map: [
            '......<A-[]>..................',
            '...<A-[]><A-02>...............',
            '......<A-01>......<S-02>......',
            '...............<S-[]><S-01>...',
            '............<S-01><S-[]><S-01>',
            '...<J-[]>......<S-01><S-01>...',
            '<J-01><J-[]>......<S-[]>......',
            '...<J-[]>.....................',
            '............<F-03>............',
            '.........<F-[]><F-01>.........',
            '............<F-[]>............',
        ],
        // if type = NEW -> value = максимально возможный итоговый PET LEVEL
        // value - какой PET LEVEL можно получить из карты максимум
        task: {type: TASK.NEW, value: 5, turns: 12},
        bg: BG_GRADIENT_NAME.Green
    },

    // MAP 4-2
    {
        map: [
            '..............................',
            '......<S-01>......<A-01>......',
            '...<S-01><S-01><A-01><A-01>...',
            '......<S-01><S-01><A-01>......',
            '.........<O-XX><J-XX>.........',
            '......<O-[]><O-[]><J-01>......',
            '...<O-[]><O-[]><J-03><J-01>...',
            '......<O-[]>......<J-01>......',
            '..............................',
        ],
        // if type = NEW -> value = максимально возможный итоговый PET LEVEL
        // value - какой PET LEVEL можно получить из карты максимум
        task: {type: TASK.NEW, value: 5, turns: 0},
        bg: BG_GRADIENT_NAME.Gold
    },

    // MAP 4-3
    {
        map: [
            '......<S-04>......<A-01>......',
            '...<S-XX>............<A-XX>...',
            '.........<O-01><O-01>.........',
            '......<O-01><O-01><O-01>......',
            '...<O-01><O-01><O-01><O-01>...',
            '......<O-01><O-01><O-01>......',
            '.........<O-01><O-01>.........',
            '...<J-XX>............<F-XX>...',
            '......<J-01>......<F-04>......',
        ],
        // if type = NEW -> value = максимально возможный итоговый PET LEVEL
        // value - какой PET LEVEL можно получить из карты максимум
        task: {type: TASK.NEW, value: 6, turns: 17},
        bg: BG_GRADIENT_NAME.Glam
    },

    // POINT 5
    // MAP 5-1
    {
        map:  [
            '.........<S-XX>.........',
            '......<O-01><O-01>......',
            '...<O-01><F-51><O-01>...',
            '<O-04><J-02><S-51><O-04>',
            '...<O-01><J-02><O-01>...',
            '......<O-01><O-01>......',
            '.........<J-XX>.........',
        ],
        task: {type: TASK.LOCK, value: 2, turns: 0},
        bg: BG_GRADIENT_NAME.Indigo
    },

    // MAP 5-2
    {
        map:  [
            '......<A-01><A-03>......',
            '...<A-[]>......<A-[]>...',
            '.........<O-04>.........',
            '......<O-01><O-03>......',
            '.........<O-02>.........',
            '...<S-[]>......<S-[]>....',
            '......<S-02><S-02>......',
        ],
        // if type = NEW -> value = максимально возможный итоговый PET LEVEL
        // value - какой PET LEVEL можно получить из карты максимум
        task: {type: TASK.NEW, value: 6, turns: 0},
        bg: BG_GRADIENT_NAME.Pink
    },

    // MAP 5-3
    {
        map:  [
            '...<F-03><F-03><F-05>...',
            '......<F-03><F-05><F-05>',
            '...<S-[]>......<F-05>...',
            '<S-XX>..................',
            '...<S-XX><J-01>.........',
            '......<J-01><J-01>......',
            '.........<J-01>.........',
        ],
        task: {type: TASK.LOCK, value: 2, turns: 18},
        bg: BG_GRADIENT_NAME.Sky
    },

    // POINT 6
    // MAP 6-1
    {
        map:  [
            '.........<O-01><O-01>.........',
            '............<O-01>............',
            '......<S-01>......<J-01>......',
            '...<S-01>...<A-01>...<J-01>...',
            '.........<A-01><A-01>.........',
            '...<J-01>...<A-01>...<S-01>...',
            '......<J-01>......<S-01>......',
            '............<F-01>............',
            '.........<F-01><F-01>.........',
        ],
        // if type = NEW -> value = максимально возможный итоговый PET LEVEL
        // value - какой PET LEVEL можно получить из карты максимум
        task: {type: TASK.NEW, value: 7, turns: 18},
        bg: BG_GRADIENT_NAME.Snow
    },

    // MAP 6-2
    {
        map:  [
            '............<J-01>............',
            '.........<J-01><J-01>.........',
            '......<J-02><J-02><J-02>......',
            '...<J-03><J-03><J-03><J-03>...',
            '<J-XX><J-[]><J-XX><J-[]><J-XX>',
            '..............................',
            '......<A-03><A-51><A-03>......',
            '.........<A-51><A-51>.........',
            '......<O-04><O-04><O-04>......',
        ],
        task: {type: TASK.LOCK, value: 3, turns: 0},
        bg: BG_GRADIENT_NAME.lilac
    },

    // MAP 6-3
    {
        map:  [
            '............<O-[]>............',
            '.........<O-04><O-04>.........',
            '......<O-04><O-51><O-04>......',
            '...<O-04><A-[]><A-[]><O-04>...',
            '<O-[]><A-XX><A-XX><A-XX><O-[]>',
            '...<O-04><A-[]><A-[]><O-04>...',
            '......<O-04><O-51><O-04>......',
            '.........<O-04><O-04>.........',
            '............<O-51>............',
        ],
        task: {type: TASK.LOCK, value: 3, turns: 16},
        bg: BG_GRADIENT_NAME.Blue
    },

    // POINT 7
    // MAP 7-1
    {
        map: [
            '........................',
            '.........<S-01>.........',
            '......<S-01><S-01>......',
            '...<S-SS><S-01><S-SS>...',
            '......<S-01><S-01>......',
            '.........<S-SS>.........',
            '........................',
        ],
        task: {type: TASK.CLOUD, value: 3, turns: 0},
        bg: BG_GRADIENT_NAME.Gold
    },

    // MAP 7-2
    {
        map: [
            '...<A-[]>......<A-[]>...',
            '......<A-01><A-51>......',
            '...<A-03><A-SS><A-04>...',
            '<A-01><A-SS><A-SS><A-02>',
            '...<A-03><A-SS><A-04>...',
            '......<A-51><A-02>......',
            '...<A-[]>......<A-[]>...',
        ],
        // if type = NEW -> value = максимально возможный итоговый PET LEVEL
        // value - какой PET LEVEL можно получить из карты максимум
        task: {type: TASK.NEW, value: 7, turns: 0},
        bg: BG_GRADIENT_NAME.Indigo
    },

    // MAP 7-3
    {
        map: [
            '......<A-SS><A-SS>......',
            '...<S-01><A-[]><A-01>...',
            '<F-01><S-[]><S-[]>......',
            '...<F-01><S-[]><J-SS>...',
            '..................<J-SS>',
            '...<J-01><J-[]><J-SS>...',
            '......<J-01><J-[]><J-[]>',
            '...<J-01><J-[]><J-01>...',
            '......<J-01><J-01>......',
        ],
        task: {type: TASK.CLOUD, value: 5, turns: 0},
        bg: BG_GRADIENT_NAME.Sky
    },

    // POINT 8
    // MAP 8-1
    {
        map: [
            '......<O-[]>............',
            '...<O-[]><O-[]><O-[]>...',
            '......<O-04><O-04><O-04>',
            '...<O-04><O-XX><O-XX>...',
            '......<O-04><O-SS><O-04>',
            '.........<O-XX><O-XX>...',
            '............<O-51>......',
        ],
        task: {type: TASK.CLOUD, value: 1, turns: 0},
        bg: BG_GRADIENT_NAME.lilac
    },

    // MAP 8-2
    {
        map: [
            '......<A-SS><A-SS>.........',
            '...<A-XX><A-SS><A-SS>......',
            '<F-[]><A-XX><A-XX>.........',
            '...<F-51><S-01><S-01>......',
            '......<S-01><S-01><O-04>...',
            '.........<J-05><O-04><O-[]>',
            '......<J-05><O-04><O-04>...',
            '.........<J-05><O-04>......',
        ],
        task: {type: TASK.LOCK, value: 3, turns: 20},
        bg: BG_GRADIENT_NAME.Glam
    },

    // MAP 8-3
    {
        map: [
            '........................',
            '...<O-SS><O-01><S-SS>...',
            '<O-SS><O-02><O-03><S-04>',
            '...<O-04><O-01><F-02>...',
            '<O-02><O-02><S-01><F-01>',
            '...<S-01><S-01><F-01>...',
            '........................',
        ],
        // if type = NEW -> value = максимально возможный итоговый PET LEVEL
        // value - какой PET LEVEL можно получить из карты максимум
        task: {type: TASK.NEW, value: 7, turns: 20},
        bg: BG_GRADIENT_NAME.Green
    },

    // POINT 9
    // MAP 9-1
    {
        map: [
            '.........<A-01><A-01>.........',
            '......<A-01><A-01><A-01>......',
            '...<J-01><O-01><O-01><J-01>...',
            '<J-01><O-01>......<O-01><J-01>',
            '...<J-01>............<J-01>...',
            '<J-01><O-01>......<O-01><J-01>',
            '...<J-01><O-01><O-01><J-01>...',
            '......<A-01><A-01><A-01>......',
            '.........<A-01><A-01>.........',
        ],
        // if type = NEW -> value = максимально возможный итоговый PET LEVEL
        // value - какой PET LEVEL можно получить из карты максимум
        task: {type: TASK.NEW, value: 8, turns: 0},
        bg: BG_GRADIENT_NAME.Pink
    },

    // MAP 9-2
    {
        map: [
            '...<F-SS>......<F-SS>...',
            '<J-[]>............<J-[]>',
            '...<J-03>......<J-03>...',
            '<J-03>...<O-04>...<J-03>',
            '...<J-03>......<J-03>...',
            '......<J-[]><J-[]>......',
            '.........<F-SS>.........',
        ],
        task: {type: TASK.CLOUD, value: 3, turns: 8},
        bg: BG_GRADIENT_NAME.Snow
    },

    // MAP 9-3
    {
        map: [
            '......<O-04><O-04>......',
            '...<O-SS>......<O-SS>...',
            '.........<J-03>.........',
            '......<J-03><J-03>......',
            '.........<J-03>.........',
            '...<O-SS>......<O-SS>....',
            '......<O-04><O-04>......',
        ],
        task: {type: TASK.CLOUD, value: 4, turns: 0},
        bg: BG_GRADIENT_NAME.Gold
    },

    // POINT 10
    // MAP 10-1
    {
        map: [
            '......<J-XX><A-02><A-02>......',
            '...<J-SS><J-SS><A-02><S-01>...',
            '......<J-XX>......<S-51>......',
            '...<J-SS><J-SS><S-01><S-01>...',
            '<J-05><J-XX>......<S-01><S-01>',
            '...<J-SS><J-SS><S-01><S-01>...',
            '......<J-XX>......<S-51>......',
            '...<J-SS><J-SS><O-04><F-03>...',
            '......<J-51><O-04><O-04>......',
        ],
        task: {type: TASK.LOCK, value: 4, turns: 24},
        bg: BG_GRADIENT_NAME.Pink
    },

    // MAP 10-2
    {
        map: [
            '......<S-01><F-03><S-01>......',
            '.........<A-[]><S-01>.........',
            '......<S-01><F-03><A-[]>......',
            '.........<A-[]><S-01>.........',
            '<J-02>......<J-02>......<J-02>',
            '...<J-02><J-02><J-02><J-02>...',
            '......<J-02><J-02><J-02>......',
            '.........<J-02><J-02>.........',
            '......<O-04><J-02><O-04>......',
            '.........<O-04><O-04>.........',
            '............<O-04>............',
        ],
        // if type = NEW -> value = максимально возможный итоговый PET LEVEL
        // value - какой PET LEVEL можно получить из карты максимум
        task: {type: TASK.NEW, value: 10, turns: 20},
        bg: BG_GRADIENT_NAME.lilac
    },

    // MAP 10-3
    {
        map: [
            '............<A-02>............',
            '......<A-02><A-[]><A-02>......',
            '...<A-[]><A-02><A-[]><A-02>...',
            '......<S-[]><A-[]><A-[]>......',
            '...<S-01><F-SS><F-SS><A-[]>...',
            '<O-[]><F-SS><F-SS><F-SS><J-[]>',
            '...<O-[]><F-SS><F-SS><J-[]>...',
            '......<O-[]><J-[]><J-[]>......',
            '...<O-04><O-04><J-05><J-05>...',
            '......<O-[]><O-[]><J-05>......',
            '.........<O-04><O-[]>.........',
        ],
        task: {type: TASK.CLOUD, value: 7, turns: 0},
        bg: BG_GRADIENT_NAME.Glam
    },

    // POINT 11
    // MAP 11-1
    {
        map:  [
            '......<A-03><A-01>......',
            '...<A-01><A-02><A-01>...',
            '<A-SS>..................',
            '...<A-01><A-51><A-01>...',
            '..................<A-SS>',
            '...<A-01><A-02><A-01>...',
            '......<A-01><A-04>......',
        ],
        // if type = NEW -> value = максимально возможный итоговый PET LEVEL
        // value - какой PET LEVEL можно получить из карты максимум
        task: {type: TASK.NEW, value: 7, turns: 0},
        bg: BG_GRADIENT_NAME.Indigo
    },

    // MAP 11-2
    {
        map:  [
            '......<A-02><A-02>......',
            '...<A-02><A-02>.........',
            '<F-03><A-02><F-03>......',
            '...<S-01><S-01><J-51>...',
            '......<J-SS><J-SS><F-03>',
            '.........<J-XX><J-XX>...',
            '......<S-06><J-XX>......',
        ],
        task: {type: TASK.LOCK, value: 3, turns: 0},
        bg: BG_GRADIENT_NAME.Snow
    },

    // MAP 11-3
    {
        map:  [
            '.........<F-SS>.........',
            '......<S-05><S-05>......',
            '...<S-05><S-05><S-05>...',
            '<F-XX><S-05><S-05><F-XX>',
            '...<J-51><J-51><S-05>...',
            '......<J-51><J-51>......',
            '.........<F-XX>.........',
        ],
        task: {type: TASK.LOCK, value: 3, turns: 24},
        bg: BG_GRADIENT_NAME.Gold
    },

    // POINT 12
    // MAP 12-1
    {
        map:  [
            '......<A-02><A-02>......',
            '...<O-04><O-[]><O-04>...',
            '<A-02><O-XX><O-XX><A-02>',
            '...<O-[]><O-SS><O-[]>...',
            '<A-02><O-XX><O-XX><A-02>',
            '...<O-04><O-[]><O-04>...',
            '......<A-02><A-02>......',
        ],
        task: {type: TASK.CLOUD, value: 1, turns: 12},
        bg: BG_GRADIENT_NAME.Pink
    },

    // MAP 12-2
    {
        map:  [
            '.........<A-01>.........',
            '......<A-02><A-02>......',
            '...<A-01>......<A-01>...',
            '<A-02>...<J-51>...<A-02>',
            '...<A-01>......<A-01>...',
            '......<A-02><A-02>......',
            '.........<A-01>.........',
        ],
        // if type = NEW -> value = максимально возможный итоговый PET LEVEL
        // value - какой PET LEVEL можно получить из карты максимум
        task: {type: TASK.NEW, value: 8, turns: 24},
        bg: BG_GRADIENT_NAME.lilac
    },

    // MAP 12-3
    {
        map:  [
            '......<A-[]>..................',
            '...<A-[]><A-04>...............',
            '......<A-SS>......<S-SS>......',
            '...............<S-SS><S-SS>...',
            '............<S-03><S-04><S-02>',
            '...<J-01>......<S-01><S-03>...',
            '<J-SS><J-01>......<S-02>......',
            '...<J-SS>.....................',
            '............<F-SS>............',
            '.........<F-SS><F-51>.........',
            '............<F-SS>............',
        ],
        task: {type: TASK.CLOUD, value: 9, turns: 0},
        bg: BG_GRADIENT_NAME.Blue
    },

    // POINT 13
    // MAP 13-1
    {
        map: [
            '..............................',
            '......<F-01>......<F-01>......',
            '...<F-01><F-01><F-01><F-01>...',
            '......<F-01><A-SS><F-01>......',
            '.........<J-SS><S-SS>.........',
            '......<F-01><O-SS><F-01>......',
            '...<F-01><F-01><F-01><F-01>...',
            '......<F-01>......<F-01>......',
            '..............................',
        ],
        // if type = NEW -> value = максимально возможный итоговый PET LEVEL
        // value - какой PET LEVEL можно получить из карты максимум
        task: {type: TASK.NEW, value: 8, turns: 0},
        bg: BG_GRADIENT_NAME.Gold
    },

    // MAP 13-2
    {
        map: [
            '......<S-SS>......<O-SS>......',
            '...<S-XX>...<A-51>...<O-XX>...',
            '.........<A-02><A-02>.........',
            '......<A-02><A-51><A-02>......',
            '...<A-51><A-51><A-51><A-51>...',
            '......<A-02><A-51><A-02>......',
            '.........<A-02><A-02>.........',
            '...<J-XX>...<A-51>...<F-03>...',
            '......<J-SS>......<F-SS>......',
        ],
        task: {type: TASK.CLOUD, value: 4, turns: 18},
        bg: BG_GRADIENT_NAME.Indigo
    },

    // MAP 13-3
    {
        map: [
            '.........<S-51>.........',
            '......<J-05><J-05>......',
            '...<J-05><J-05><J-05>...',
            '<S-XX><J-05><J-05><S-XX>',
            '...<J-05><J-05><J-05>...',
            '......<J-05><J-05>......',
            '.........<S-XX>.........',
        ],
        task: {type: TASK.LOCK, value: 3, turns: 20},
        bg: BG_GRADIENT_NAME.Sky
    },

    // POINT 14
    // MAP 14-1
    {
        map: [
            '......<O-XX><O-04>......',
            '...<J-04>......<F-[]>...',
            '.........<A-02>.........',
            '......<A-02><A-02>......',
            '.........<A-02>.........',
            '...<F-04>......<J-04>....',
            '......<O-04><O-XX>......',
        ],
        task: {type: TASK.LOCK, value: 2, turns: 0},
        bg: BG_GRADIENT_NAME.lilac
    },

    // MAP 14-2
    {
        map: [
            '............<O-01>............',
            '.........<O-01><O-01>.........',
            '...<O-01>............<O-01>...',
            '<O-01>...<A-01><A-01>...<O-01>',
            '......<A-01><A-51><A-01>......',
            '<O-01>...<A-01><A-01>...<O-01>',
            '...<O-01>............<O-01>...',
            '.........<O-01><O-01>.........',
            '............<O-01>............',
        ],
        // if type = NEW -> value = максимально возможный итоговый PET LEVEL
        // value - какой PET LEVEL можно получить из карты максимум
        task: {type: TASK.NEW, value: 9, turns: 26},
        bg: BG_GRADIENT_NAME.Glam
    },

    // MAP 14-3
    {
        map: [
            '...<S-SS><S-SS><S-SS>...',
            '<S-SS><S-SS><S-SS><S-SS>',
            '...<S-[]><S-[]><S-[]>...',
            '........................',
            '...<F-01><F-01><F-01>...',
            '<F-01><F-01><F-01><F-01>',
            '...<F-01><F-01><F-01>...',
        ],
        task: {type: TASK.CLOUD, value: 7, turns: 0},
        bg: BG_GRADIENT_NAME.Green
    },

    // POINT 15
    // MAP 15-1
    {
        map: [
            '............<A-01>............',
            '.........<A-01><A-01>.........',
            '......<A-01><A-01><A-01>......',
            '...<A-01><A-01><A-01><A-01>...',
            '<A-01><A-01><A-51><A-01><A-01>',
            '...<A-01><A-01><A-01><A-01>...',
            '......<A-01><A-01><A-01>......',
            '.........<A-01><A-01>.........',
            '............<A-01>............',
        ],
        // if type = NEW -> value = максимально возможный итоговый PET LEVEL
        // value - какой PET LEVEL можно получить из карты максимум
        task: {type: TASK.NEW, value: 9, turns: 0},
        bg: BG_GRADIENT_NAME.Pink
    },

    // MAP 15-2
    {
        map: [
            '.........<S-51>.........',
            '......<S-02><S-06>......',
            '...<S-03><O-04><S-05>...',
            '<O-[]><O-[]><O-[]><O-[]>',
            '...<O-[]><J-XX><O-[]>...',
            '......<O-[]><O-[]>......',
            '.........<O-[]>.........',
        ],
        task: {type: TASK.LOCK, value: 1, turns: 7},
        bg: BG_GRADIENT_NAME.Snow
    },

    // MAP 15-3
    {
        map: [
            '......<A-[]>..................',
            '...<A-[]><A-02>...............',
            '......<A-01>......<S-[]>......',
            '...............<S-[]><S-SS>...',
            '............<S-51><S-SS><S-SS>',
            '...<J-[]>......<S-[]><S-SS>...',
            '<J-01><J-[]>......<S-[]>......',
            '...<J-[]>.....................',
            '............<F-03>............',
            '.........<F-02><F-01>.........',
            '............<F-[]>............',
        ],
        task: {type: TASK.CLOUD, value: 4, turns: 9},
        bg: BG_GRADIENT_NAME.Blue
    },

    // POINT 16
    // MAP 16-1
    {
        map: [
            '............<A-02>............',
            '.........<A-02><A-02>.........',
            '......<A-02><A-02><A-02>......',
            '...<A-02><A-02><A-02><A-02>...',
            '<A-01><F-XX><F-XX><F-XX><A-01>',
            '...<O-01><F-51><F-51><O-01>...',
            '<A-01><F-XX><F-XX><F-XX><A-01>',
            '...<A-02><A-02><A-02><A-02>...',
            '......<A-02><A-02><A-02>......',
            '.........<A-02><A-02>.........',
            '............<A-02>............',
        ],
        task: {type: TASK.LOCK, value: 6, turns: 0},
        bg: BG_GRADIENT_NAME.Glam
    },

    // MAP 16-2
    {
        map: [
            '...<J-01>...<O-02>...<A-01>...',
            '.........<F-03><A-04>.........',
            '......<O-05><S-06><J-07>......',
            '...<S-08><J-09><F-10><A-11>...',
            '<O-12><S-13><S-14><S-15><J-16>',
            '...<S-17><J-18><F-19><A-20>...',
            '<O-21><S-22><S-23><S-24><J-25>',
            '...<S-26><J-27><F-28><A-29>...',
            '......<O-30><S-31><J-32>......',
            '.........<F-33><A-34>.........',
            '...<A-01>...<O-02>...<J-01>...',
        ],
        task: {type: TASK.CLOUD, value: 7, turns: 0},
        bg: BG_GRADIENT_NAME.Gold
    },

    // MAP 16-3
    {
        map: [
            '......<S-04>......<A-01>......',
            '...<S-XX>............<A-XX>...',
            '.........<O-01><O-01>.........',
            '......<O-01><O-01><O-01>......',
            '...<O-01><O-01><O-01><O-01>...',
            '......<O-01><O-01><O-01>......',
            '.........<O-01><O-01>.........',
            '...<J-XX>............<F-XX>...',
            '......<J-01>......<F-04>......',
        ],
        // if type = NEW -> value = максимально возможный итоговый PET LEVEL
        // value - какой PET LEVEL можно получить из карты максимум
        task: {type: TASK.NEW, value: 9, turns: 9},
        bg: BG_GRADIENT_NAME.Green
    },

    // POINT 17
    // MAP 17-1
    {
        map:  [
            '........................',
            '........................',
            '.........<S-01>.........',
            '......<J-01><F-01>......',
            '.........<S-01>.........',
            '........................',
            '........................',
        ],
        // if type = NEW -> value = максимально возможный итоговый PET LEVEL
        // value - какой PET LEVEL можно получить из карты максимум
        task: {type: TASK.NEW, value: 9, turns: 9},
        bg: BG_GRADIENT_NAME.Indigo
    },

    // MAP 17-2
    {
        map:  [
            '........................',
            '........................',
            '.........<S-01>.........',
            '......<J-01><F-01>......',
            '.........<S-01>.........',
            '........................',
            '........................',
        ],
        task: {type: TASK.CLOUD, value: 2, turns: 0},
        bg: BG_GRADIENT_NAME.Pink
    },

    // MAP 17-3
    {
        map:  [
            '........................',
            '........................',
            '.........<S-01>.........',
            '......<J-01><F-01>......',
            '.........<S-01>.........',
            '........................',
            '........................',
        ],
        task: {type: TASK.CLOUD, value: 2, turns: 9},
        bg: BG_GRADIENT_NAME.Sky
    },

    // POINT 18
    // MAP 18-1
    {
        map:  [
            '........................',
            '........................',
            '.........<S-01>.........',
            '......<J-01><F-01>......',
            '.........<S-01>.........',
            '........................',
            '........................',
        ],
        task: {type: TASK.LOCK, value: 7, turns: 0},
        bg: BG_GRADIENT_NAME.Snow
    },

    // MAP 18-2
    {
        map:  [
            '........................',
            '........................',
            '.........<S-01>.........',
            '......<J-01><F-01>......',
            '.........<S-01>.........',
            '........................',
            '........................',
        ],
        task: {type: TASK.LOCK, value: 5, turns: 15},
        bg: BG_GRADIENT_NAME.lilac
    },

    // MAP 18-3
    {
        map:  [
            '........................',
            '........................',
            '.........<S-01>.........',
            '......<J-01><F-01>......',
            '.........<S-01>.........',
            '........................',
            '........................',
        ],
        // if type = NEW -> value = максимально возможный итоговый PET LEVEL
        // value - какой PET LEVEL можно получить из карты максимум
        task: {type: TASK.NEW, value: 9, turns: 9},
        bg: BG_GRADIENT_NAME.Gold
    },

    // POINT 19
    // MAP 19-1
    {
        map: [
            '........................',
            '.........<A-01>.........',
            '......<A-01><A-01>......',
            '...<S-01><S-[]><A-01>...',
            '......<S-01><J-01>......',
            '.........<S-01>.........',
            '........................',
        ],
        // if type = NEW -> value = максимально возможный итоговый PET LEVEL
        // value - какой PET LEVEL можно получить из карты максимум
        task: {type: TASK.NEW, value: 9, turns: 9},
        bg: BG_GRADIENT_NAME.Pink
    },

    // MAP 19-2
    {
        map: [
            '........................',
            '...<A-[]>......<A-[]>...',
            '<A-01><A-01><A-01><A-01>',
            '...<A-01><A-[]><A-01>...',
            '......<S-01><S-01>......',
            '.........<S-[]>.........',
            '........................',
        ],
        task: {type: TASK.CLOUD, value: 4, turns: 9},
        bg: BG_GRADIENT_NAME.lilac
    },

    // MAP 19-3
    {
        map: [
            '......<A-01><A-01>......',
            '...<A-01><A-[]><A-01>...',
            '<F-01>..................',
            '...<S-01><S-[]><F-01>...',
            '..................<J-01>',
            '...<J-01><J-[]><J-01>...',
            '......<J-01><J-01>......',
        ],
        task: {type: TASK.CLOUD, value: 5, turns: 0},
        bg: BG_GRADIENT_NAME.Snow
    },

    // POINT 20
    // MAP 20-1
    {
        map: [
            '......<A-01>............',
            '...<A-01><A-[]>.........',
            '<F-02><A-01><A-01>......',
            '...<S-01><S-XX><J-01>...',
            '......<J-01><J-01><F-02>',
            '.........<J-[]><J-01>...',
            '............<J-01>......',
        ],
        task: {type: TASK.LOCK, value: 1, turns: 9},
        bg: BG_GRADIENT_NAME.Sky
    },

    // MAP 20-2
    {
        map: [
            '.........<J-01>.........',
            '......<J-02><J-02>......',
            '...<S-[]><S-[]><S-[]>...',
            '<S-01><S-01><S-01><S-01>',
            '...<S-[]><S-51><S-[]>...',
            '......<J-02><J-02>......',
            '.........<J-01>.........',
        ],
        // if type = NEW -> value = максимально возможный итоговый PET LEVEL
        // value - какой PET LEVEL можно получить из карты максимум
        task: {type: TASK.NEW, value: 9, turns: 0},
        bg: BG_GRADIENT_NAME.Indigo
    },

    // MAP 20-3
    {
        map: [
            '........................',
            '...<A-01><A-XX><A-01>...',
            '<F-01><S-01><S-02><F-01>',
            '...<S-02><S-01><F-02>...',
            '<S-01><S-01><F-01><J-01>',
            '...<J-01><J-XX><J-01>...',
            '........................',
        ],
        task: {type: TASK.CLOUD, value: 2, turns: 9},
        bg: BG_GRADIENT_NAME.Green
    },

    // POINT 21
    // MAP 21-1
    {
        map: [
            '.........<A-01>.........',
            '......<A-01><A-01>......',
            '...<A-01><A-01><A-01>...',
            '<A-01><A-01><F-01><A-01>',
            '...<A-01><S-01><S-01>...',
            '......<F-01><J-01>......',
            '.........<J-01>.........',
        ],
        // if type = NEW -> value = максимально возможный итоговый PET LEVEL
        // value - какой PET LEVEL можно получить из карты максимум
        task: {type: TASK.NEW, value: 9, turns: 9},
        bg: BG_GRADIENT_NAME.Glam
    },

    // MAP 21-2
    {
        map: [
            '.........<J-01>.........',
            '......<J-02><J-02>......',
            '...<J-[]>......<J-[]>...',
            '<J-01>...<F-XX>...<J-01>',
            '...<J-[]>......<S-[]>...',
            '......<J-02><J-02>......',
            '.........<J-01>.........',
        ],
        task: {type: TASK.LOCK, value: 1, turns: 7},
        bg: BG_GRADIENT_NAME.Blue
    },

    // MAP 21-3
    {
        map: [
            '.........<J-01>.........',
            '......<J-02><J-02>......',
            '...<S-XX><S-01><S-01>...',
            '<S-01><S-01><S-01><S-01>',
            '...<S-01><S-01><S-XX>...',
            '......<J-02><J-02>......',
            '.........<J-01>.........',
        ],
        task: {type: TASK.LOCK, value: 7, turns: 0},
        bg: BG_GRADIENT_NAME.lilac
    },

    // POINT 22
    // MAP 22-1
    {
        map: [
            '............<O-SS>............',
            '.........<F-01><A-01>.........',
            '......<O-01><S-01><J-01>......',
            '...<S-01><J-XX><F-XX><A-01>...',
            '<O-01><S-XX><S-SS><S-XX><J-01>',
            '...<S-01><J-SS><F-SS><A-01>...',
            '<O-01><S-XX><S-SS><S-XX><J-01>',
            '...<S-01><J-XX><F-XX><A-01>...',
            '......<O-01><S-01><J-01>......',
            '.........<F-01><A-01>.........',
            '............<O-01>............',
        ],
        // if type = NEW -> value = максимально возможный итоговый PET LEVEL
        // value - какой PET LEVEL можно получить из карты максимум
        task: {type: TASK.NEW, value: 9, turns: 9},
        bg: BG_GRADIENT_NAME.Sky
    },

    // MAP 22-2
    {
        map: [
            '...<J-01>...<O-02>...<A-01>...',
            '.........<F-03><A-04>.........',
            '......<O-05><S-06><J-07>......',
            '...<S-08><J-09><F-10><A-11>...',
            '<O-12><S-13><S-14><S-15><J-16>',
            '...<S-17><J-18><F-19><A-20>...',
            '<O-21><S-22><S-23><S-24><J-25>',
            '...<S-26><J-27><F-28><A-29>...',
            '......<O-30><S-31><J-32>......',
            '.........<F-33><A-34>.........',
            '...<A-01>...<O-02>...<J-01>...',
        ],
        task: {type: TASK.LOCK, value: 7, turns: 7},
        bg: BG_GRADIENT_NAME.Indigo
    },

    // MAP 22-3
    {
        map: [
            '............<A-SS>............',
            '.........<A-09><A-09>.........',
            '......<A-07><A-08><O-07>......',
            '...<A-06><A-06><A-06><O-06>...',
            '<O-SS><O-05><O-05><O-05><O-SS>',
            '...<O-04><O-04><O-04><O-04>...',
            '<O-SS><S-03><J-03><O-03><O-SS>',
            '...<J-01><J-02><F-02><O-01>...',
            '......<J-02><S-01><J-02>......',
            '.........<S-01><S-01>.........',
            '............<F-SS>............',
        ],
        task: {type: TASK.CLOUD, value: 7, turns: 7},
        bg: BG_GRADIENT_NAME.Glam
    },
]